;
; Example locale file that converts all of the strings to their uppercase
; equivalent. If you want to make your own, copy this file to locale.ini and
; then edit it with the text editor of your choice.
;
; To make your own, replace each string to the right of an equal sign with
; the text that you want to appear in place of the string to the left of the
; equal sign.
;
; & may be used to optionally mark a menu string's access key.
;
; \t, followed by a string, may be used to optionally denote a menu string's
; short cut key. These are fixed right now so the only thing you can choose
; to do is either display them or not.
;

[&Game]
&Game=&GAME
&Load=&LOAD\tL
&Save=&SAVE\tS
&Previous=&PREVIOUS\tP
&Next=&NEXT\tN
Ran&dom=RAN&DOM\tD
N&umber...=N&UMBER...\tU
&Restart=&RESTART\tR
Sol&ve=SOL&VE
E&xit=E&XIT

[&Difficulty]
&Difficulty=&DIFFICULTY
&Beginner=&BEGINNER\tB
&Easy=&EASY\tE
&Medium=&MEDIUM\tM
&Hard=&HARD\tH
E&xtreme=E&XTREME\tX
&Adjust...=&ADJUST...\tA

[&View]
&View=&VIEW
&Check for Errors=&CHECK FOR ERRORS\tC
Possible &Values=POSSIBLE &VALUES\tV
&Fonts...=&FONTS...\tF

[&Help]
&Help=&HELP
Play &Help=PLAY &HELP\tF1
&About USB Sudoku=&ABOUT USB SUDOKU

[Statusbar]
Beginner=BEGINNER
Easy=EASY
Medium=MEDIUM
Hard=HARD
Extreme=EXTREME
%s (%d%% max) puzzle %d=%s (%d%% MAX) PUZZLE %d
Generating (%d solutions analyzed)...=GENERATING (%d SOLUTIONS ANALYZED)...
%s (%d%% max) puzzle %d (rated at %d%%)=%s (%d%% MAX) PUZZLE %d (RATED AT %d%%)
%d cells done (%.1f%%) %d to go=%d CELLS DONE (%.1f%%) %d TO GO
%s puzzle %d (rated at %d%%)=%s PUZZLE %d (RATED AT %d%%)
%s puzzle %d=%s PUZZLE %d

[AboutDialog]
About USB Sudoku=ABOUT USB SUDOKU
USB Sudoku Version 2=USB SUDOKU VERSION 2
All versions of MS Windows supported=ALL VERSIONS OF MS WINDOWS SUPPORTED
A very small executable for playing the original game of Sudoku. Created specifically for use from a USB stick drive. But usable from any file system device.=A VERY SMALL EXECUTABLE FOR PLAYING THE ORIGINAL GAME OF SUDOKU. CREATED SPECIFICALLY FOR USE FROM A USB STICK DRIVE. BUT USABLE FROM ANY FILE SYSTEM DEVICE.
USB Sudoku is "green." The registry is not used. No file system writes are made except when USB Sudoku is exited.=USB SUDOKU IS "GREEN." THE REGISTRY IS NOT USED. NO FILE SYSTEM WRITES ARE MADE EXCEPT WHEN USB SUDOKU IS EXITED.
GPL'd solver and rater by Bill Dupree. A "heuristic" approach is used to rate the difficulty of each game. All generated games are guaranteed to have only one solution.=GPL'D SOLVER AND RATER BY BILL DUPREE. A "HEURISTIC" APPROACH IS USED TO RATE THE DIFFICULTY OF EACH GAME. ALL GENERATED GAMES ARE GUARANTEED TO HAVE ONLY ONE SOLUTION.
Free (GPL'd) and available at sourceforge.net.=FREE (GPL'D) AND AVAILABLE AT SOURCEFORGE.NET.
Packed with UPX.=PACKED WITH UPX.

[DifficultyDialog]
&Beginner Min:=&BEGINNER MIN:
&Beginner Max:=&BEGINNER MAX:
&Easy Max:=&EASY MAX:
&Medium Max:=&MEDIUM MAX:
&Hard Max:=&HARD MAX:
E&xtreme Max:=E&XTREME MAX:
&Reset to defaults=&RESET TO DEFAULTS

[GameNumberDialog]
Game Number=GAME NUMBER
&Number:=&NUMBER:
Enter a value between 1 and 9,999,999 inclusive, to play a specific game number.=ENTER A VALUE BETWEEN 1 AND 9,999,999 INCLUSIVE, TO PLAY A SPECIFIC GAME NUMBER.
Enter 0 to play a randomly selected game.=ENTER 0 TO PLAY A RANDOMLY SELECTED GAME.
OK=OK
Cancel=CANCEL

[HelpDialog]
USB Sudoku Help=USB SUDOKU HELP
Under Construction.=UNDER CONSTRUCTION.
Please see the included readme.txt file for keyboard and mouse usage and how to customize the look.=PLEASE SEE THE INCLUDED README.TXT FILE FOR KEYBOARD AND MOUSE USAGE AND HOW TO CUSTOMIZE THE LOOK.

[SelectNumberDialog]
&1=&ONE
&2=&TWO
&3=&THREE
&4=&FOUR
&5=&FIVE
&6=&SIX
&7=&SEVEN
&8=&EIGHT
&9=&NINE
&0 (clear)=&ZERO (CLEAR)
&Show as possible=&SHOW AS POSSIBLE
&Remove as possible=&REMOVE AS POSSIBLE
